dsname = 'mpei'
uniname = 'МЭИ'
url_base = 'https://www.pkmpei.ru/inform/entrants_list{}.html'
pages = [
	('ЭНМИ', '15.03.01', 'Машиностроение'),
	('ЭНМИ', '15.03.06', 'Мехатроника и робототехника'),
	('ЭНМИ', '15.03.03', 'Прикладная механика'),
	('ЭНМИ', '13.03.03', 'Энергетическое машиностроение'),
	('ИТАЭ', '13.03.01', 'Теплоэнергетика и теплотехника'),
	('ИТАЭ', '13.03.01', 'Теплоэнергетика и теплотехника'),
	('ИТАЭ', '14.03.01', 'Ядерная энергетика и теплофизика'),
	('ИПЭЭФ','13.03.01', 'Теплоэнергетика и теплотехника'),
	('ИнЭИ', '38.03.01', 'Экономика'),
	('ИЭТ',  '11.03.04', 'Электроника и наноэлектроника'),
	('ИЭТ',  '13.03.02', 'Электроэнергетика и электротехника'),
	('ИДДО', '13.04.01', 'Теплоэнергетика и теплотехника'),
	('ИЭЭ',  '13.03.02', 'Электроэнергетика и электротехника'),
	('АВТИ', '09.03.01', 'Информатика и вычислительная техника'),
	('АВТИ', '12.03.01', 'Приборостроение'),
	('АВТИ', '01.03.02', 'Прикладная математика и информатика'),
	('АВТИ', '27.03.04', 'Управление в технических системах'),
	('ИРЭ',  '12.03.04', 'Биотехнические системы и технологии'),
	('ИРЭ',  '11.03.01', 'Радиотехника'),
	('ИРЭ',  '11.05.01', 'Радиоэлектронные системы и комплексы'),
	('ИРЭ',  '11.03.04', 'Электроника и наноэлектроника'),
	('ИнЭИ', '10.03.01', 'Информационная безопасность'),
	('ИнЭИ', '10.03.01', 'Информационная безопасность'),
	('ИнЭИ', '38.03.02', 'Менеджмент'),
	('ИДДО', '38.03.01', 'Экономика')
]
""":obj:`list` of :obj:`int`: Pages to be checked. Page number = index + 1.
Possibly shouldn`t be hardcoded.
"""

student_fields = {
	1: [
		'score_sum', 'score_1',
		'score_extra', 'name',
		'birth_date', 'dormitory',
		'agreement', 'notes'
	],
	2: [
		'score_sum', 'score_1',
		'score_2', 'score_extra',
		'name', 'birth_date',
		'dormitory', 'agreement',
		'notes'
	],
	3: [
		'score_sum', 'score_1',
		'score_2', 'score_3',
		'score_extra', 'name',
		'birth_date', 'dormitory',
		'agreement', 'notes'
	],
	4: [
		'score_sum', 'score_1',
		'score_2', 'score_3',
		'score_4', 'score_extra',
		'name', 'birth_date',
		'dormitory', 'agreement',
		'notes'
	],
	5: [
		'score_sum', 'score_1',
		'score_2', 'score_3',
		'score_4', 'score_5',
		'score_extra', 'name',
		'birth_date', 'dormitory',
		'agreement', 'notes'
	],
	6: [
		'score_sum', 'score_1',
		'score_2', 'score_3',
		'score_4', 'score_5',
		'score_6', 'score_extra',
		'name', 'birth_date',
		'dormitory', 'agreement',
		'notes'
	]
}
"""Describes the table fields"""

without_exam = 'Без вступительных испытаний'
revoked = 'Забрал документы'