dsname = 'mpei'
uniname = 'МЭИ'
url_base = 'https://www.pkmpei.ru/inform/entrants_list{}.html'
pages = [
	('ЭНМИ', '15.03.01', 'Машиностроение', [1, 322, 295]),
	('ЭНМИ', '15.03.06', 'Мехатроника и робототехника', [2, 323, 296]),
	('ЭНМИ', '15.03.03', 'Прикладная механика', [3, 324, 297]),
	('ЭНМИ', '13.03.03', 'Энергетическое машиностроение', [4, 325, 298]),
	('ИТАЭ', '13.03.01', 'Теплоэнергетика и теплотехника', [5, 326, 299]),
	('ИТАЭ', '14.03.01', 'Ядерная энергетика и теплофизика', [7, 327, 300]),
	('ИПЭЭФ','13.03.01', 'Теплоэнергетика и теплотехника', [8, 328, 301]),
	('ИЭТ',  '11.03.04', 'Электроника и наноэлектроника', [10, 329, ]),
	('ИЭТ',  '13.03.02', 'Электроэнергетика и электротехника', [11, 330, 302]),
	('ИЭЭ',  '13.03.02', 'Электроэнергетика и электротехника', [13, 331, 303]),
	('АВТИ', '09.03.01', 'Информатика и вычислительная техника', [14, 332, 304]),
	('АВТИ', '12.03.01', 'Приборостроение', [15, 333, 305]),
	('АВТИ', '01.03.02', 'Прикладная математика и информатика', [16, 334, 65]),
	('АВТИ', '27.03.04', 'Управление в технических системах', [17, 335, 306]),
	('ИРЭ',  '12.03.04', 'Биотехнические системы и технологии', [18, 336]),
	('ИРЭ',  '11.03.01', 'Радиотехника', [19, 337, 307]),
	('ИРЭ',  '11.05.01', 'Радиоэлектронные системы и комплексы', [20, 338, 308]),
	('ИРЭ',  '11.03.04', 'Электроника и наноэлектроника', [21, 339, 309]),
	('ИнЭИ', '10.03.01', 'Информационная безопасность (Организация и технология защиты информации)', [22, 340, 310]),
	('ИнЭИ', '10.03.01', 'Информационная безопасность (Безопасность компьютерных систем)', [463, 466, 465]),
	('ИнЭИ', '09.03.03', 'Прикладная информатика', [35, 342, 312]),
	('ИнЭИ', '38.03.05', 'Бизнес-информатика', []),
	('ИнЭИ', '38.03.02', 'Менеджмент', []),
	('ИнЭИ', '38.03.01', 'Экономика', []),
	('ГПИ',  '54.03.01', 'Дизайн', []),
	('ГПИ',  '45.03.02', 'Лингвистика', []),
	('ГПИ',  '42.03.01', 'Реклама и связи с общественностью', [])
]
""":obj:`list` of :obj:`int`: Pages to be checked. Page number = index + 1.
Possibly shouldn`t be hardcoded.
"""

student_fields = {
	1: [
		'score_sum', 'score_1',
		'score_extra', 'name',
		'birth_date', 'dormitory',
		'agreement', 'notes'
	],
	2: [
		'score_sum', 'score_1',
		'score_2', 'score_extra',
		'name', 'birth_date',
		'dormitory', 'agreement',
		'notes'
	],
	3: [
		'score_sum', 'score_1',
		'score_2', 'score_3',
		'score_extra', 'name',
		'birth_date', 'dormitory',
		'agreement', 'notes'
	],
	4: [
		'score_sum', 'score_1',
		'score_2', 'score_3',
		'score_4', 'score_extra',
		'name', 'birth_date',
		'dormitory', 'agreement',
		'notes'
	],
	5: [
		'score_sum', 'score_1',
		'score_2', 'score_3',
		'score_4', 'score_5',
		'score_extra', 'name',
		'birth_date', 'dormitory',
		'agreement', 'notes'
	],
	6: [
		'score_sum', 'score_1',
		'score_2', 'score_3',
		'score_4', 'score_5',
		'score_6', 'score_extra',
		'name', 'birth_date',
		'dormitory', 'agreement',
		'notes'
	]
}
"""Describes the table fields"""

str_without_exam = 'Без вступительных испытаний'
str_revoked = 'Забрал документы'

time_fmt = '%H:%M %d.%m.%Y'