dsname = 'mephi'
uniname = 'МИФИ'
facname = '_'

url_pages = 'https://org.mephi.ru/pupil-rating'
url_base = 'https://org.mephi.ru/pupil-rating/get-rating/entity/{}/original/no'

str_no_applications = 'Нет заявлений'

str_budget = 'Бюджет'

str_target = 'Целевой прием'
str_without_exam = 'Без экзаменов'
str_spec = 'Особые права'
str_general = 'Общий конкурс'

class_group = ['throw']
class_entry = ['trPos', 'trPosBen']

codes = {
	'Бизнес-информатика': '38.03.05',
	'Биотехнические системы и технологии': '12.03.04',
	'Высокотехнологические плазменные и энергетические установки': '16.03.02',
	'Информатика и вычислительная техника': '09.03.01',
	'Информатика и вычислительная техника, очно-заочная': '09.03.01',
	'Информационная безопасность': '10.03.01',
	'Лазерная техника и лазерные технологии': '12.03.05',
	'Материаловедение и технологии материалов': '22.03.01',
	'Международные отношения': '41.03.05',
	'Мехатроника и робототехника': '15.03.06',
	'Прикладная математика и информатика': '01.03.02',
	'Прикладные математика и физика': '03.03.01',
	'Программная инженерия': '09.03.04',
	'Системный анализ и управление': '27.03.03',
	'Физика': '03.03.02',
	'Фотоника и оптоинформатика': '12.03.03',
	'Экономика': '38.03.01',
	'Электроника и наноэлектроника': '11.03.04',
	'Ядерные физика и технологии': '14.03.02',
	'Ядерные физика и технологии, очно-заочная': '14.03.02',
	'Атомные станции: проектирование, эксплуатация и инжиниринг': '14.05.02',
	'Безопасность информационных технологий в правоохранительной сфере': '10.05.05',
	'Информационно-аналитические системы безопасности': '10.05.04',
	'Применение и эксплуатация автоматизированных систем специального назначения': '09.05.01',
	'Экономическая безопасность': '38.05.01',
	'Электроника и автоматика физических установок': '14.05.04',
	'Электроника и автоматика физических установок, очно-заочная': '14.05.04',
	'Ядерные реакторы и материалы': '14.05.01'
}
